## 시리즈 연습하기

In [1]:
import pandas as pd
import numpy as np

In [4]:
pd.Series(dtype='int8')

Series([], dtype: int8)

In [5]:
ice크림맛들 = [
    "Chocolate",
    "Vanilla",
    "Strawberry",
    "Rum Raisin",
]
pd.Series(ice크림맛들)

0     Chocolate
1       Vanilla
2    Strawberry
3    Rum Raisin
dtype: object

In [6]:
pd.Series(data=ice크림맛들)

0     Chocolate
1       Vanilla
2    Strawberry
3    Rum Raisin
dtype: object

In [7]:
days요일들 = ("월요일", '수요일', '금요일', '토요일')

pd.Series(data=ice크림맛들, index=days요일들)

월요일     Chocolate
수요일       Vanilla
금요일    Strawberry
토요일    Rum Raisin
dtype: object

In [8]:
bool참거짓데이터 = [True, False, False]
pd.Series(bool참거짓데이터)

0     True
1    False
2    False
dtype: bool

In [9]:
stock_주식가격 = [123.4,512.3]
stock_장시작좀료 = ('장시작', '장종료')

pd.Series(stock_주식가격,stock_장시작좀료)

장시작    123.4
장종료    512.3
dtype: float64

In [11]:
lucky_낫랜덤번호 = list(range(1,50,3))
pd.Series(lucky_낫랜덤번호)

0      1
1      4
2      7
3     10
4     13
5     16
6     19
7     22
8     25
9     28
10    31
11    34
12    37
13    40
14    43
15    46
16    49
dtype: int64

In [12]:
pd.Series(data=lucky_낫랜덤번호, dtype='float')

0      1.0
1      4.0
2      7.0
3     10.0
4     13.0
5     16.0
6     19.0
7     22.0
8     25.0
9     28.0
10    31.0
11    34.0
12    37.0
13    40.0
14    43.0
15    46.0
16    49.0
dtype: float64

In [13]:
# np.nan 사용하기

temp_온도데이터 = [93,31,23,np.nan, 11,22]
pd.Series(temp_온도데이터)

0    93.0
1    31.0
2    23.0
3     NaN
4    11.0
5    22.0
dtype: float64

In [16]:
data_딕셔너리={
   '시리얼' : 125,
    '시리얼2' : 1125,
    '시리얼3' : 3125,
}

diet = pd.Series(data=data_딕셔너리)
diet

시리얼      125
시리얼2    1125
시리얼3    3125
dtype: int64

In [17]:
pd.Series(data = ("빨강", "조황","검정"))

0    빨강
1    조황
2    검정
dtype: object

In [18]:
rgb삼원색 = [
    (12,31,23),
    (15,23,111)
]
pd.Series(data= rgb삼원색)

0     (12, 31, 23)
1    (15, 23, 111)
dtype: object

In [20]:
# 셋트는 리스트 변환후 사용해야함
myset = {12,3123,3123}
try:
    pd.Series(myset)
except:
    print("세트는 사용못함")
print(pd.Series(list(myset)))

세트는 사용못함
0    3123
1      12
dtype: int64

In [21]:
r랜덤데이터 = np.random.randint(1,100,11)
pd.Series(data=r랜덤데이터)

0     71
1     57
2     57
3     28
4     88
5     47
6     66
7     59
8     88
9     38
10    57
dtype: int32

In [22]:
diet.values

array([ 125, 1125, 3125], dtype=int64)

In [23]:
type(diet.values)

numpy.ndarray

In [24]:
diet.index

Index(['시리얼', '시리얼2', '시리얼3'], dtype='object')

In [25]:
type(diet.index)

pandas.core.indexes.base.Index

In [26]:
diet.dtype

dtype('int64')

In [27]:
diet.size

3

In [28]:
diet.shape

(3,)

In [29]:
diet.is_unique

True

In [30]:
pd.Series(data=[1,2,1]).is_unique

False

In [31]:
pd.Series(data=[1,2,3]).is_monotonic_increasing

True

In [32]:
pd.Series(data=[1,2,3]).is_monotonic_decreasing

False

In [33]:
pd.Series(data=[121.3,1,23,123,12]).is_monotonic_decreasing

False

In [34]:
pd.Series(data=[121.3,1,23,123,12]).is_monotonic_increasing

False

In [36]:
v값들 = range(0,500,5)
nums = pd.Series(data=v값들)
nums

0       0
1       5
2      10
3      15
4      20
     ...
95    475
96    480
97    485
98    490
99    495
Length: 100, dtype: int64

In [37]:
nums.head(5)

0     0
1     5
2    10
3    15
4    20
dtype: int64

In [38]:
nums.head() # 기본값 5개

0     0
1     5
2    10
3    15
4    20
dtype: int64

In [39]:
nums.tail()

95    475
96    480
97    485
98    490
99    495
dtype: int64

In [40]:
nums.tail(3)

97    485
98    490
99    495
dtype: int64

In [41]:
numbers = pd.Series([1, 2, 3, np.nan, 4, 5])
numbers

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
dtype: float64

In [42]:
numbers.count()

5

In [43]:
numbers.sum()

15.0

In [44]:
numbers.sum(skipna = False)

nan

In [45]:
# 얼마나 유효값이 있어야하는지 지정
numbers.sum(min_count = 3)

15.0

In [46]:
numbers.sum(min_count = np.inf)

nan

In [47]:
numbers.sum(min_count = np.inf, skipna = True)

nan

In [48]:
numbers.product()

120.0

In [49]:
numbers.product(skipna=False)

nan

In [50]:
numbers.product(min_count=4)

120.0

In [51]:
numbers.product(min_count=np.inf)

nan

In [52]:
numbers.cumprod()

0      1.0
1      2.0
2      6.0
3      NaN
4     24.0
5    120.0
dtype: float64

In [53]:
numbers.cummax()

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
dtype: float64

In [54]:
numbers.pct_change()

C:\Users\Administrator\AppData\Local\Temp\ipykernel_15312\463408457.py:1: FutureWarning: The default fill_method='pad' in Series.pct_change is deprecated and will be removed in a future version. Either fill in any non-leading NA values prior to calling pct_change or specify 'fill_method=None' to not fill NA values.
  numbers.pct_change()

0         NaN
1    1.000000
2    0.500000
3    0.000000
4    0.333333
5    0.250000
dtype: float64

In [55]:
numbers.pct_change(fill_method="pad")

C:\Users\Administrator\AppData\Local\Temp\ipykernel_15312\3250896556.py:1: FutureWarning: The 'fill_method' keyword being not None and the 'limit' keyword in Series.pct_change are deprecated and will be removed in a future version. Either fill in any non-leading NA values prior to calling pct_change or specify 'fill_method=None' to not fill NA values.
  numbers.pct_change(fill_method="pad")

0         NaN
1    1.000000
2    0.500000
3    0.000000
4    0.333333
5    0.250000
dtype: float64

In [56]:
numbers.pct_change(fill_method='ffill')

C:\Users\Administrator\AppData\Local\Temp\ipykernel_15312\2920631834.py:1: FutureWarning: The 'fill_method' keyword being not None and the 'limit' keyword in Series.pct_change are deprecated and will be removed in a future version. Either fill in any non-leading NA values prior to calling pct_change or specify 'fill_method=None' to not fill NA values.
  numbers.pct_change(fill_method='ffill')

0         NaN
1    1.000000
2    0.500000
3    0.000000
4    0.333333
5    0.250000
dtype: float64

In [57]:
numbers.pct_change(fill_method= 'bfill')

C:\Users\Administrator\AppData\Local\Temp\ipykernel_15312\3937815382.py:1: FutureWarning: The 'fill_method' keyword being not None and the 'limit' keyword in Series.pct_change are deprecated and will be removed in a future version. Either fill in any non-leading NA values prior to calling pct_change or specify 'fill_method=None' to not fill NA values.
  numbers.pct_change(fill_method= 'bfill')

0         NaN
1    1.000000
2    0.500000
3    0.333333
4    0.000000
5    0.250000
dtype: float64

In [58]:
numbers.mean()

3.0

In [59]:
numbers.median()

3.0

In [60]:
numbers.std()

1.5811388300841898

In [61]:
numbers.max()

5.0

In [62]:
numbers.min()

1.0

In [63]:
animas = pd.Series(['코알라', '아드카보노','지브라'])
animas

0      코알라
1    아드카보노
2      지브라
dtype: object

In [64]:
animas.max()

'코알라'

In [65]:
animas.min()

'아드카보노'

In [66]:
numbers.describe()

count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64

In [69]:
numbers.describe(include='all')

count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64

In [70]:
numbers.sample(2)

4    4.0
5    5.0
dtype: float64

In [71]:
authors = pd.Series(
    [
        "해밍웨이",
        '오웰',
        'Dostoevsky',
        'Fitzgerald',
        'orwell'
    ]
)
authors.unique()

array(['해밍웨이', '오웰', 'Dostoevsky', 'Fitzgerald', 'orwell'], dtype=object)

In [72]:
authors.nunique()

5

In [73]:
s1 = pd.Series(data = [5, np.nan, 15], index = ["A", "B", "C"])
s1

A     5.0
B     NaN
C    15.0
dtype: float64

In [74]:
s1 + 3

A     8.0
B     NaN
C    18.0
dtype: float64

In [75]:
s1.add(3)

A     8.0
B     NaN
C    18.0
dtype: float64

In [76]:
s1 - 5

A     0.0
B     NaN
C    10.0
dtype: float64

In [77]:
s1.sub(5)

A     0.0
B     NaN
C    10.0
dtype: float64

In [78]:
s1.subtract(5)

A     0.0
B     NaN
C    10.0
dtype: float64

In [80]:
s1.subtract(5, fill_value=0)

A     0.0
B    -5.0
C    10.0
dtype: float64

In [81]:
s1 / 2

A    2.5
B    NaN
C    7.5
dtype: float64

In [82]:
s1.div(2)

A    2.5
B    NaN
C    7.5
dtype: float64

In [83]:
s1.divide(2)

A    2.5
B    NaN
C    7.5
dtype: float64

In [84]:
s1 // 4

A    1.0
B    NaN
C    3.0
dtype: float64

In [85]:
s1.floordiv(4)

A    1.0
B    NaN
C    3.0
dtype: float64

In [86]:
s1 % 3

A    2.0
B    NaN
C    0.0
dtype: float64

In [87]:
s1.mod(3, fill_value=1)

A    2.0
B    1.0
C    0.0
dtype: float64

In [88]:
s1 = pd.Series([1, 2, 3], index = ["A", "B", "C"])
s2 = pd.Series([4, 5, 6], index = ["A", "B", "C"])

In [89]:
s1 + s2

A    5
B    7
C    9
dtype: int64

In [91]:
s1 = pd.Series(data = [3, 6, np.nan, 12])
s2 = pd.Series(data = [2, 6, np.nan, 12])
s1 == s2

0    False
1     True
2    False
3     True
dtype: bool

In [92]:
s1 != s2

0     True
1    False
2     True
3    False
dtype: bool

In [93]:
s1 = pd.Series(
    data = [5, 10, 15], index = ["A", "B", "C"]
)

s2 = pd.Series(
    data = [4, 8, 12, 14], index = ["B", "C", "D", "E"]
)

In [94]:
s1 + s2

A     NaN
B    14.0
C    23.0
D     NaN
E     NaN
dtype: float64

In [95]:
cities = pd.Series(["센프란시트코", '로스산토스', '라스베가스', np.nan])
len(cities)

4

In [96]:
type(cities)

pandas.core.series.Series

In [97]:
dir(cities)

['T',
 '_AXIS_LEN',
 '_AXIS_ORDERS',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__bool__',
 '__class__',
 '__column_consortium_standard__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__float__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__int__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pandas_priority__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_accum_func',
 '_agg_examples_doc',
 '_agg_see_also_doc',
 '_align_for_op',
 '_align_frame',
 '_align_series',
 '_append',
 '_arith_method',
 '_as_manager',
 '_attrs',
 '_binop',
 '_can_hold_na',
 '_check_inplace_and_allows_duplicate_labels',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_cmp_method',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_result',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_expanddim_from_mgr',
 '_constructor_from_mgr',
 '_convert_dtypes',
 '_data',
 '_deprecate_downcast',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_duplicated',
 '_expanddim_from_mgr',
 '_find_valid_index',
 '_flags',
 '_flex_method',
 '_from_mgr',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_index_resolvers',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_rows_with_mask',
 '_get_value',
 '_get_values_tuple',
 '_get_with',
 '_getitem_slice',
 '_gotitem',
 '_hidden_attrs',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_init_dict',
 '_init_mgr',
 '_inplace_method',
 '_internal_names',
 '_internal_names_set',
 '_is_cached',
 '_is_copy',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_item_cache',
 '_ixs',
 '_logical_func',
 '_logical_method',
 '_map_values',
 '_maybe_update_cacher',
 '_memory_usage',
 '_metadata',
 '_mgr',
 '_min_count_stat_function',
 '_name',
 '_needs_reindex_multi',
 '_pad_or_backfill',
 '_protect_consolidate',
 '_reduce',
 '_references',
 '_reindex_axes',
 '_reindex_indexer',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_rename',
 '_replace_single',
 '_repr_data_resource_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_axis_nocheck',
 '_set_is_copy',
 '_set_labels',
 '_set_name',
 '_set_value',
 '_set_values',
 '_set_with',
 '_set_with_engine',
 '_shift_with_freq',
 '_slice',
 '_stat_function',
 '_stat_function_ddof',
 '_take_with_is_copy',
 '_to_latex_via_styler',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'array',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'attrs',
 'autocorr',
 'axes',
 'backfill',
 'between',
 'between_time',
 'bfill',
 'bool',
 'clip',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtype',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'explode',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'ge',
 'get',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'interpolate',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'rdivmod',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'sem',
 'set_axis',
 'set_flags',
 'shape',
 'shift',
 'size',
 'skew',
 'sort_index',
 'sort_values',
 'squeeze',
 'std',
 'str',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_list',
 'to_markdown',
 'to_numpy',
 'to_period',
 'to_pickle',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs']

In [98]:
list(cities)

['센프란시트코', '로스산토스', '라스베가스', nan]

In [99]:
dict(cities)

{0: '센프란시트코', 1: '로스산토스', 2: '라스베가스', 3: nan}

In [100]:
"로스산토스" in cities

False

In [101]:
2 in cities

True

In [102]:
"로스산토스" in cities.values

True

In [104]:
100 not in cities

True

In [106]:
"rat" not in cities.values

True

In [110]:
superheroes = [
"Batman",
"Superman",
"Spider-Man",
"Iron Man",
"Captain America",
"Wonder Woman"
]
strength_levels = (100, 120, 90, 95, 110, 120)

In [122]:
heros_onlyname = pd.Series(superheroes)
heros_onlyname

0             Batman
1           Superman
2         Spider-Man
3           Iron Man
4    Captain America
5       Wonder Woman
dtype: object

In [115]:
heros힘 = pd.Series(strength_levels)
heros힘

0    100
1    120
2     90
3     95
4    110
5    120
dtype: int64

In [124]:
heros = pd.Series(data=strength_levels, index=superheroes, name='체력')
heros

Batman             100
Superman           120
Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
Name: 체력, dtype: int64

In [126]:
heros.head(2)

Batman      100
Superman    120
Name: 체력, dtype: int64

In [127]:
heros.tail(4)

Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
Name: 체력, dtype: int64

In [128]:
heros.nunique()

5

In [130]:
print(f"{heros.mean():.2f}")

105.83

In [131]:
print(f"max = {heros.max()} min = {heros.min()}")

max = 120 min = 90

In [132]:
heros.multiply(2)

Batman             200
Superman           240
Spider-Man         180
Iron Man           190
Captain America    220
Wonder Woman       240
Name: 체력, dtype: int64

In [133]:
dict(heros)

{'Batman': 100,
 'Superman': 120,
 'Spider-Man': 90,
 'Iron Man': 95,
 'Captain America': 110,
 'Wonder Woman': 120}

## Series Method

In [135]:
pd.read_csv(filepath_or_buffer= '../DATA/pokemon.csv')

         Pokemon            Type
0      Bulbasaur  Grass / Poison
1        Ivysaur  Grass / Poison
2       Venusaur  Grass / Poison
3     Charmander            Fire
4     Charmeleon            Fire
..           ...             ...
804    Stakataka    Rock / Steel
805  Blacephalon    Fire / Ghost
806      Zeraora        Electric
807       Meltan           Steel
808     Melmetal           Steel

[809 rows x 2 columns]

In [136]:
pd.read_csv('../DATA/pokemon.csv')

         Pokemon            Type
0      Bulbasaur  Grass / Poison
1        Ivysaur  Grass / Poison
2       Venusaur  Grass / Poison
3     Charmander            Fire
4     Charmeleon            Fire
..           ...             ...
804    Stakataka    Rock / Steel
805  Blacephalon    Fire / Ghost
806      Zeraora        Electric
807       Meltan           Steel
808     Melmetal           Steel

[809 rows x 2 columns]

In [137]:
pd.read_csv('../DATA/pokemon.csv',index_col='Pokemon')

                       Type
Pokemon
Bulbasaur    Grass / Poison
Ivysaur      Grass / Poison
Venusaur     Grass / Poison
Charmander             Fire
Charmeleon             Fire
...                     ...
Stakataka      Rock / Steel
Blacephalon    Fire / Ghost
Zeraora            Electric
Meltan                Steel
Melmetal              Steel

[809 rows x 1 columns]

In [139]:
# pd.read_csv('../DATA/pokemon.csv', index_col='Pokemon', squeeze = True) deprecated

In [140]:
pd.read_csv('../DATA/google_stocks.csv').tail(4)

            Date    Close
3820  2019-10-22  1242.80
3821  2019-10-23  1259.13
3822  2019-10-24  1260.99
3823  2019-10-25  1265.13

In [141]:
pd.read_csv('../DATA/google_stocks.csv', parse_dates=["Date"], index_col='Date')

              Close
Date
2004-08-19    49.98
2004-08-20    53.95
2004-08-23    54.50
2004-08-24    52.24
2004-08-25    52.80
...             ...
2019-10-21  1246.15
2019-10-22  1242.80
2019-10-23  1259.13
2019-10-24  1260.99
2019-10-25  1265.13

[3824 rows x 1 columns]

In [142]:
pd.read_csv('../DATA/revolutionary_war.csv').tail(3)

                        Battle  Start Date     State
229  Action of 18 October 1782  10/18/1782       NaN
230  Action of 6 December 1782   12/6/1782       NaN
231  Action of 22 January 1783   1/22/1783  Virginia

In [145]:
pd.read_csv('../DATA/revolutionary_war.csv', index_col='Start Date', parse_dates=['Start Date']).tail(3)

                               Battle     State
Start Date
1782-10-18  Action of 18 October 1782       NaN
1782-12-06  Action of 6 December 1782       NaN
1783-01-22  Action of 22 January 1783  Virginia

In [147]:
pd.read_csv(
    '../DATA/revolutionary_war.csv',
    index_col= 'Start Date',
    parse_dates= ['Start Date'],
    usecols=['State', 'Start Date'],
)

                    State
Start Date
1774-09-01  Massachusetts
1774-12-14  New Hampshire
1775-04-19  Massachusetts
1775-04-19  Massachusetts
1775-04-20       Virginia
...                   ...
1782-09-11       Virginia
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
1783-01-22       Virginia

[232 rows x 1 columns]

In [150]:
google = pd.read_csv('../DATA/google_stocks.csv', parse_dates=['Date'], index_col='Date')

In [151]:
google

              Close
Date
2004-08-19    49.98
2004-08-20    53.95
2004-08-23    54.50
2004-08-24    52.24
2004-08-25    52.80
...             ...
2019-10-21  1246.15
2019-10-22  1242.80
2019-10-23  1259.13
2019-10-24  1260.99
2019-10-25  1265.13

[3824 rows x 1 columns]

In [153]:
google.sort_values(by = 'Close')

              Close
Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
...             ...
2019-04-23  1264.55
2019-10-25  1265.13
2018-07-26  1268.33
2019-04-26  1272.18
2019-04-29  1287.58

[3824 rows x 1 columns]

In [155]:
pokemon = pd.read_csv('../DATA/pokemon.csv', index_col='Pokemon')
pokemon

                       Type
Pokemon
Bulbasaur    Grass / Poison
Ivysaur      Grass / Poison
Venusaur     Grass / Poison
Charmander             Fire
Charmeleon             Fire
...                     ...
Stakataka      Rock / Steel
Blacephalon    Fire / Ghost
Zeraora            Electric
Meltan                Steel
Melmetal              Steel

[809 rows x 1 columns]

In [157]:
pokemon.sort_values('Pokemon', ascending=False)

                      Type
Pokemon
Zygarde    Dragon / Ground
Zweilous     Dark / Dragon
Zubat      Poison / Flying
Zorua                 Dark
Zoroark               Dark
...                    ...
Aegislash    Steel / Ghost
Accelgor               Bug
Absol                 Dark
Abra               Psychic
Abomasnow      Grass / Ice

[809 rows x 1 columns]

In [160]:
google.sort_values(by = 'Close', ascending= False).head(3)

              Close
Date
2019-04-29  1287.58
2019-04-26  1272.18
2018-07-26  1268.33

In [164]:
battles = pd.read_csv('../DATA/revolutionary_war.csv')
battles.set_index("Battle", inplace=True)
battles

                                   Start Date          State
Battle
Powder Alarm                         9/1/1774  Massachusetts
Storming of Fort William and Mary  12/14/1774  New Hampshire
Battles of Lexington and Concord    4/19/1775  Massachusetts
Siege of Boston                     4/19/1775  Massachusetts
Gunpowder Incident                  4/20/1775       Virginia
...                                       ...            ...
Siege of Fort Henry                 9/11/1782       Virginia
Grand Assault on Gibraltar          9/13/1782            NaN
Action of 18 October 1782          10/18/1782            NaN
Action of 6 December 1782           12/6/1782            NaN
Action of 22 January 1783           1/22/1783       Virginia

[232 rows x 2 columns]

In [166]:
battles.sort_values(by = 'State', na_position='first')

                              Start Date     State
Battle
Siege of Fort St. Jean         9/17/1775       NaN
Battle of Quebec              12/31/1775       NaN
Battle of Nassau                3/3/1776       NaN
Battle of Saint-Pierre         3/25/1776       NaN
Battle of The Cedars           5/18/1776       NaN
...                                  ...       ...
Battle of Green Spring          7/6/1781  Virginia
Francisco's Fight               7/1/1781  Virginia
Battle of Spencer's Ordinary   6/26/1781  Virginia
Battle of Blandford            4/25/1781  Virginia
Action of 22 January 1783      1/22/1783  Virginia

[232 rows x 2 columns]

In [171]:
battles.sort_values(by = 'State', na_position='last')

                            Start Date        State
Battle
Battle of Groton Heights      9/6/1781  Connecticut
Tryon's raid                  7/5/1779  Connecticut
Battle of Ridgefield         4/27/1777  Connecticut
Battle of Cooch's Bridge      9/3/1777     Delaware
Battle of Thomas Creek       5/17/1777      Florida
...                                ...          ...
Hudson Bay Expedition         8/8/1782          NaN
Battle of Trincomalee        8/25/1782          NaN
Grand Assault on Gibraltar   9/13/1782          NaN
Action of 18 October 1782   10/18/1782          NaN
Action of 6 December 1782    12/6/1782          NaN

[232 rows x 2 columns]

In [172]:
battles.dropna().sort_values(by = 'State')

                             Start Date        State
Battle
Battle of Ridgefield          4/27/1777  Connecticut
Tryon's raid                   7/5/1779  Connecticut
Battle of Groton Heights       9/6/1781  Connecticut
Battle of Cooch's Bridge       9/3/1777     Delaware
Battle of Lake Pontchartrain  9/10/1779      Florida
...                                 ...          ...
Battle of Blandford           4/25/1781     Virginia
Battle of Cape Henry          3/16/1781     Virginia
Burning of Norfolk             1/1/1776     Virginia
Siege of Yorktown             9/28/1781     Virginia
Action of 22 January 1783     1/22/1783     Virginia

[160 rows x 2 columns]

In [175]:
google.nlargest(columns='Close', n=5)

              Close
Date
2019-04-29  1287.58
2019-04-26  1272.18
2018-07-26  1268.33
2019-10-25  1265.13
2019-04-23  1264.55

In [176]:
google.nlargest(columns='Close', n=3)

              Close
Date
2019-04-29  1287.58
2019-04-26  1272.18
2018-07-26  1268.33

In [177]:
google.nsmallest(columns='Close', n = 3)

            Close
Date
2004-09-03  49.82
2004-09-01  49.94
2004-08-19  49.98

In [178]:
battles.head(3)

                                   Start Date          State
Battle
Powder Alarm                         9/1/1774  Massachusetts
Storming of Fort William and Mary  12/14/1774  New Hampshire
Battles of Lexington and Concord    4/19/1775  Massachusetts

In [181]:
battles.sort_index().head(3)

                             Start Date State
Battle
Action of 1 May 1781           5/1/1781   NaN
Action of 11 November 1779   11/11/1779   NaN
Action of 14 September 1779   9/14/1779   NaN

In [183]:
battles.head(3)

                                   Start Date          State
Battle
Powder Alarm                         9/1/1774  Massachusetts
Storming of Fort William and Mary  12/14/1774  New Hampshire
Battles of Lexington and Concord    4/19/1775  Massachusetts

In [184]:
battles.sort_values(by='Start Date',inplace=True)
battles.head(3)

                        Start Date     State
Battle
Burning of Norfolk        1/1/1776  Virginia
Siege of Brimstone Hill  1/11/1782       NaN
Capture of Trincomalee   1/11/1782       NaN

In [185]:
pokemon.head()

                      Type
Pokemon
Bulbasaur   Grass / Poison
Ivysaur     Grass / Poison
Venusaur    Grass / Poison
Charmander            Fire
Charmeleon            Fire

In [186]:
len(pokemon.value_counts())

159

In [187]:
pokemon.nunique()

Type    159
dtype: int64

In [188]:
pokemon.value_counts(ascending= False)

Type
Normal             65
Water              61
Grass              38
Psychic            35
Fire               30
                   ..
Fire / Rock         1
Rock / Fighting     1
Normal / Dragon     1
Fire / Ghost        1
Water / Steel       1
Name: count, Length: 159, dtype: int64

In [190]:
pokemon.value_counts(normalize=True).head() * 100

Type
Normal     8.034611
Water      7.540173
Grass      4.697157
Psychic    4.326329
Fire       3.708282
Name: proportion, dtype: float64

In [191]:
pokemon.value_counts(normalize=True).head().round(4) * 100

Type
Normal     8.03
Water      7.54
Grass      4.70
Psychic    4.33
Fire       3.71
Name: proportion, dtype: float64

In [192]:
google.value_counts().head()

Close
290.41    3
237.04    3
287.68    3
307.10    3
194.27    3
Name: count, dtype: int64

In [193]:
google.max()

Close    1287.58
dtype: float64

In [194]:
google.min()

Close    49.82
dtype: float64

In [202]:
battles.value_counts().head()

Start Date  State
8/18/1780   South Carolina    2
8/22/1777   New York          2
4/19/1775   Massachusetts     2
1/1/1776    Virginia          1
7/24/1779   Massachusetts     1
Name: count, dtype: int64

In [203]:
battles.value_counts(dropna = False).head()

Start Date  State
NaN         NaN               2
8/22/1777   New York          2
4/19/1775   Massachusetts     2
3/16/1782   NaN               2
8/18/1780   South Carolina    2
Name: count, dtype: int64

In [204]:
battles.index

Index(['Burning of Norfolk', 'Siege of Brimstone Hill',
       'Capture of Trincomalee', 'Battle of Cape St. Vincent',
       'Battle of Cowpens', 'Second Battle of Trenton',
       'Battle of Videau's Bridge', 'Battle of Millstone',
       'Capture of Demerara and Essequibo', 'Action of 22 January 1783',
       ...
       'Battle of the Chesapeake', 'Battle of Groton Heights',
       'Siege of Boonesborough', 'Invasion of Dominica',
       'Capture of Fort Bute', 'Battle of Eutaw Springs', 'Forage War',
       'First Siege of Fort Henry', 'San Juan Expedition',
       'Battle of the Black River'],
      dtype='object', name='Battle', length=232)

In [205]:
funcs = [len , max, min]


for func in funcs:
    print(func(google))

3824
Close
Close

In [206]:
google.apply(func = round)

             Close
Date
2004-08-19    50.0
2004-08-20    54.0
2004-08-23    54.0
2004-08-24    52.0
2004-08-25    53.0
...            ...
2019-10-21  1246.0
2019-10-22  1243.0
2019-10-23  1259.0
2019-10-24  1261.0
2019-10-25  1265.0

[3824 rows x 1 columns]

In [234]:
singMulti = lambda x : "Multi" if str(x).find('/') > 0 else "Single"

In [235]:

poketype = pokemon.apply(singMulti, axis='columns')

poketype.loc['Ivysaur']

'Multi'

In [236]:
poketype.value_counts()

Multi     405
Single    404
Name: count, dtype: int64

In [257]:
wars = pd.read_csv(
    '../DATA/revolutionary_war.csv',
    index_col='Battle',
    parse_dates=['Start Date'],
    usecols=['Battle', 'Start Date']
)

In [276]:
import datetime as dt
test = wars['Start Date'].iloc[0]
type(test.to_pydatetime() )

datetime.datetime

In [280]:
wars_to_days = wars.apply(lambda x : x.iloc[0].to_pydatetime().strftime("%A") if type(x.iloc[0]) == pd._libs.tslibs.timestamps.Timestamp else np.nan, axis='columns')

In [286]:
result = wars_to_days.value_counts()
result

Saturday     39
Friday       39
Wednesday    32
Thursday     31
Sunday       31
Tuesday      29
Monday       27
Name: count, dtype: int64

In [288]:
wars.dropna().apply(lambda x : x.iloc[0].to_pydatetime().strftime("%A"), axis='columns').value_counts()

Saturday     39
Friday       39
Wednesday    32
Thursday     31
Sunday       31
Tuesday      29
Monday       27
Name: count, dtype: int64

## DataFrame

In [289]:
city_data = {
    "City": ["New York City", "Paris", "Barcelona", "Rome"],
    "Country": ["United States", "France", "Spain", "Italy"],
    "Population": pd.Series([8600000, 2141000, 5515000, 2873000])
}

cities = pd.DataFrame(city_data)
cities

            City        Country  Population
0  New York City  United States     8600000
1          Paris         France     2141000
2      Barcelona          Spain     5515000
3           Rome          Italy     2873000

In [290]:
cities.T

                        0        1          2        3
City        New York City    Paris  Barcelona     Rome
Country     United States   France      Spain    Italy
Population        8600000  2141000    5515000  2873000

In [291]:
cities.transpose()

                        0        1          2        3
City        New York City    Paris  Barcelona     Rome
Country     United States   France      Spain    Italy
Population        8600000  2141000    5515000  2873000

In [294]:
random_data = np.random.randint(1, 101, (3, 5)
                                )
random_data

array([[71, 20, 49, 72, 35],
       [29, 92, 61, 73, 43],
       [66, 68, 50, 57,  9]])

In [295]:
pd.DataFrame(data=random_data)

    0   1   2   3   4
0  71  20  49  72  35
1  29  92  61  73  43
2  66  68  50  57   9

In [296]:
row_labels = ('아침', '점심', '저녁')
temp_온도데이터_DF = pd.DataFrame(data=random_data, index=row_labels)
temp_온도데이터_DF

     0   1   2   3   4
아침  71  20  49  72  35
점심  29  92  61  73  43
저녁  66  68  50  57   9

In [297]:
row_labels = ["Morning", "Afternoon", "Evening"]
column_labels = (
    "Monday",
    "Tuesday",
    "Wednesday",
    "Thursday",
    "Friday"
)

In [299]:
pd.DataFrame(
    data = random_data,
    index = row_labels,
    columns = column_labels,
)

           Monday  Tuesday  Wednesday  Thursday  Friday
Morning        71       20         49        72      35
Afternoon      29       92         61        73      43
Evening        66       68         50        57       9

In [300]:
pd.read_csv('../DATA/nba.csv')

               Name                 Team Position  Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG   9/26/96   1445697
1    Christian Wood      Detroit Pistons       PF   9/27/95   1645357
2     PJ Washington    Charlotte Hornets       PF   8/23/98   3831840
3      Derrick Rose      Detroit Pistons       PG   10/4/88   7317074
4     Marial Shayok   Philadelphia 76ers        G   7/26/95     79568
..              ...                  ...      ...       ...       ...
445   Austin Rivers      Houston Rockets       PG    8/1/92   2174310
446     Harry Giles     Sacramento Kings       PF   4/22/98   2578800
447     Robin Lopez      Milwaukee Bucks        C    4/1/88   4767000
448   Collin Sexton  Cleveland Cavaliers       PG    1/4/99   4764960
449     Ricky Rubio         Phoenix Suns       PG  10/21/90  16200000

[450 rows x 5 columns]

In [303]:
pd.read_csv("../DATA/nba.csv",
            parse_dates=['Birthday'])

C:\Users\Administrator\AppData\Local\Temp\ipykernel_15312\3284200645.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  pd.read_csv("../DATA/nba.csv",

               Name                 Team Position   Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF 1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG 1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26     79568
..              ...                  ...      ...        ...       ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 5 columns]

In [305]:
nba = pd.read_csv("../DATA/nba.csv", parse_dates= ['Birthday'])

C:\Users\Administrator\AppData\Local\Temp\ipykernel_15312\3219956350.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  nba = pd.read_csv("../DATA/nba.csv", parse_dates= ['Birthday'])

In [306]:
pd.Series([1,2,3]).dtype

dtype('int64')

In [307]:
nba.dtypes

Name                object
Team                object
Position            object
Birthday    datetime64[ns]
Salary               int64
dtype: object

In [308]:
nba.dtypes.value_counts()

object            3
datetime64[ns]    1
int64             1
Name: count, dtype: int64

In [309]:
nba.index

RangeIndex(start=0, stop=450, step=1)

In [310]:
nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [311]:
nba.ndim

2

In [312]:
nba.shape

(450, 5)

In [313]:
nba.size

2250

In [314]:
nba.count()

Name        450
Team        450
Position    450
Birthday    450
Salary      450
dtype: int64

In [315]:
nba.count().sum()

2250

In [317]:
data = {
    "A" : [1, np.nan],
    "B" : [2, 3]
}

df = pd.DataFrame(data)
df

     A  B
0  1.0  2
1  NaN  3

In [318]:
df.size

4

In [319]:
df.count()

A    1
B    2
dtype: int64

In [320]:
df.count().sum()

3

In [321]:
nba.head(2)

             Name                Team Position   Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG 1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF 1995-09-27  1645357

In [322]:
nba.tail(3)

              Name                 Team Position   Birthday    Salary
447    Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448  Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449    Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

In [323]:
nba.tail()

              Name                 Team Position   Birthday    Salary
445  Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446    Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447    Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448  Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449    Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

In [325]:
nba.sample(11)

                    Name                   Team Position   Birthday    Salary
371  Willie Cauley-Stein  Golden State Warriors        C 1993-08-18   2177483
356        Mason Plumlee         Denver Nuggets        C 1990-03-05  14041096
33        Furkan Korkmaz     Philadelphia 76ers       SG 1997-07-24   1620564
387        Landry Shamet   Los Angeles Clippers       SG 1997-03-13   1995120
290       Tyrone Wallace          Atlanta Hawks       PG 1994-06-10   1620564
58            Marc Gasol        Toronto Raptors        C 1985-01-29  25595700
220         Tony Bradley              Utah Jazz        C 1998-01-08   1962360
311          Cody Martin      Charlotte Hornets       SF 1995-09-28   1173310
146           OG Anunoby        Toronto Raptors       SF 1997-07-17   2281800
361     Bojan Bogdanovic              Utah Jazz       SF 1989-04-18  17000000
243       Brandon Clarke      Memphis Grizzlies       PF 1996-09-19   2478840

In [326]:
nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [327]:
nba.max()

Name             Zylan Cheatham
Team         Washington Wizards
Position                     SG
Birthday    2000-12-23 00:00:00
Salary                 40231758
dtype: object

In [328]:
nba.min()

Name               Aaron Gordon
Team              Atlanta Hawks
Position                      C
Birthday    1977-01-26 00:00:00
Salary                    79568
dtype: object

In [329]:
nba.nlargest(4, columns='Salary')

                  Name                   Team Position   Birthday    Salary
205      Stephen Curry  Golden State Warriors       PG 1988-03-14  40231758
38          Chris Paul  Oklahoma City Thunder       PG 1985-05-06  38506482
219  Russell Westbrook        Houston Rockets       PG 1988-11-12  38506482
251          John Wall     Washington Wizards       PG 1990-09-06  38199000

In [330]:
nba.nsmallest(3, columns=["Birthday"])

              Name             Team Position   Birthday   Salary
98    Vince Carter    Atlanta Hawks       PF 1977-01-26  2564753
196  Udonis Haslem       Miami Heat        C 1980-06-09  2564753
262    Kyle Korver  Milwaukee Bucks       PF 1981-03-17  6004753

In [333]:
nba.sum(numeric_only = True)

Salary    3444112694
dtype: int64

In [334]:
nba.mean(numeric_only=True)

Salary    7.653584e+06
dtype: float64

In [335]:
nba.mode(numeric_only=True)

   Salary
0   79568

In [337]:
nba.std(numeric_only=True)

Salary    9.288810e+06
dtype: float64

In [338]:
nba.sort_values("Name")

                  Name                   Team Position   Birthday    Salary
52        Aaron Gordon          Orlando Magic       PF 1995-09-16  19863636
101      Aaron Holiday         Indiana Pacers       PG 1996-09-30   2239200
437        Abdel Nader  Oklahoma City Thunder       SF 1993-09-25   1618520
81         Adam Mokoka          Chicago Bulls        G 1998-07-18     79568
399  Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000
..                 ...                    ...      ...        ...       ...
159        Zach LaVine          Chicago Bulls       PG 1995-03-10  19500000
302       Zach Norvell     Los Angeles Lakers       SG 1997-12-09     79568
312       Zhaire Smith     Philadelphia 76ers       SG 1999-06-04   3058800
137    Zion Williamson   New Orleans Pelicans        F 2000-07-06   9757440
248     Zylan Cheatham   New Orleans Pelicans       SF 1995-11-17     79568

[450 rows x 5 columns]

In [339]:
nba.sort_values(by = "Name")

                  Name                   Team Position   Birthday    Salary
52        Aaron Gordon          Orlando Magic       PF 1995-09-16  19863636
101      Aaron Holiday         Indiana Pacers       PG 1996-09-30   2239200
437        Abdel Nader  Oklahoma City Thunder       SF 1993-09-25   1618520
81         Adam Mokoka          Chicago Bulls        G 1998-07-18     79568
399  Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000
..                 ...                    ...      ...        ...       ...
159        Zach LaVine          Chicago Bulls       PG 1995-03-10  19500000
302       Zach Norvell     Los Angeles Lakers       SG 1997-12-09     79568
312       Zhaire Smith     Philadelphia 76ers       SG 1999-06-04   3058800
137    Zion Williamson   New Orleans Pelicans        F 2000-07-06   9757440
248     Zylan Cheatham   New Orleans Pelicans       SF 1995-11-17     79568

[450 rows x 5 columns]

In [341]:
nba.sort_values("Name", ascending=  False).head()

                Name                  Team Position   Birthday    Salary
248   Zylan Cheatham  New Orleans Pelicans       SF 1995-11-17     79568
137  Zion Williamson  New Orleans Pelicans        F 2000-07-06   9757440
312     Zhaire Smith    Philadelphia 76ers       SG 1999-06-04   3058800
302     Zach Norvell    Los Angeles Lakers       SG 1997-12-09     79568
159      Zach LaVine         Chicago Bulls       PG 1995-03-10  19500000

In [342]:
nba.sort_values("Birthday", ascending=False).head(6)

                    Name                   Team Position   Birthday   Salary
136      Sekou Doumbouya        Detroit Pistons       SF 2000-12-23  3285120
432  Talen Horton-Tucker     Los Angeles Lakers       GF 2000-11-25   898310
137      Zion Williamson   New Orleans Pelicans        F 2000-07-06  9757440
313           RJ Barrett        New York Knicks       SG 2000-06-14  7839960
392         Jalen Lecque           Phoenix Suns        G 2000-06-13   898310
44         Darius Bazley  Oklahoma City Thunder       PF 2000-06-12  2284800

In [343]:
nba.sort_values(["Team", "Name"])

                Name                Team Position   Birthday    Salary
359         Alex Len       Atlanta Hawks        C 1993-06-16   4160000
167     Allen Crabbe       Atlanta Hawks       SG 1992-04-09  18500000
276  Brandon Goodwin       Atlanta Hawks       PG 1995-10-02     79568
438   Bruno Fernando       Atlanta Hawks        C 1998-08-15   1400000
194      Cam Reddish       Atlanta Hawks       SF 1999-09-01   4245720
..               ...                 ...      ...        ...       ...
418     Jordan McRae  Washington Wizards       PG 1991-03-28   1645357
273  Justin Robinson  Washington Wizards       PG 1997-10-12    898310
428    Moritz Wagner  Washington Wizards        C 1997-04-26   2063520
21     Rui Hachimura  Washington Wizards       PF 1998-02-08   4469160
36     Thomas Bryant  Washington Wizards        C 1997-07-31   8000000

[450 rows x 5 columns]

In [344]:
nba.sort_values(["Team", "Name"], ascending=False)

                Name                Team Position   Birthday    Salary
36     Thomas Bryant  Washington Wizards        C 1997-07-31   8000000
21     Rui Hachimura  Washington Wizards       PF 1998-02-08   4469160
428    Moritz Wagner  Washington Wizards        C 1997-04-26   2063520
273  Justin Robinson  Washington Wizards       PG 1997-10-12    898310
418     Jordan McRae  Washington Wizards       PG 1991-03-28   1645357
..               ...                 ...      ...        ...       ...
194      Cam Reddish       Atlanta Hawks       SF 1999-09-01   4245720
438   Bruno Fernando       Atlanta Hawks        C 1998-08-15   1400000
276  Brandon Goodwin       Atlanta Hawks       PG 1995-10-02     79568
167     Allen Crabbe       Atlanta Hawks       SG 1992-04-09  18500000
359         Alex Len       Atlanta Hawks        C 1993-06-16   4160000

[450 rows x 5 columns]

In [345]:
nba.sort_values(["Team","Salary"], ascending=[True,False])

                  Name                Team Position   Birthday    Salary
111   Chandler Parsons       Atlanta Hawks       SF 1988-10-25  25102512
28         Evan Turner       Atlanta Hawks       PG 1988-10-27  18606556
167       Allen Crabbe       Atlanta Hawks       SG 1992-04-09  18500000
213    De'Andre Hunter       Atlanta Hawks       SF 1997-12-02   7068360
339      Jabari Parker       Atlanta Hawks       PF 1995-03-15   6500000
..                 ...                 ...      ...        ...       ...
80         Isaac Bonga  Washington Wizards       PG 1999-11-08   1416852
399  Admiral Schofield  Washington Wizards       SF 1997-03-30   1000000
273    Justin Robinson  Washington Wizards       PG 1997-10-12    898310
283   Garrison Mathews  Washington Wizards       SG 1996-10-24     79568
353      Chris Chiozza  Washington Wizards       PG 1995-11-21     79568

[450 rows x 5 columns]

In [346]:
nba.head()

             Name                Team Position   Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG 1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
2   PJ Washington   Charlotte Hornets       PF 1998-08-23  3831840
3    Derrick Rose     Detroit Pistons       PG 1988-10-04  7317074
4   Marial Shayok  Philadelphia 76ers        G 1995-07-26    79568

In [347]:
nba.sort_index().head(4)

             Name                Team Position   Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG 1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
2   PJ Washington   Charlotte Hornets       PF 1998-08-23  3831840
3    Derrick Rose     Detroit Pistons       PG 1988-10-04  7317074

In [348]:
nba.sort_index(ascending=False).head()

              Name                 Team Position   Birthday    Salary
449    Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000
448  Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
447    Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
446    Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
445  Austin Rivers      Houston Rockets       PG 1992-08-01   2174310

In [349]:
nba.sort_index(axis='columns').head()

    Birthday            Name Position   Salary                Team
0 1996-09-26    Shake Milton       SG  1445697  Philadelphia 76ers
1 1995-09-27  Christian Wood       PF  1645357     Detroit Pistons
2 1998-08-23   PJ Washington       PF  3831840   Charlotte Hornets
3 1988-10-04    Derrick Rose       PG  7317074     Detroit Pistons
4 1995-07-26   Marial Shayok        G    79568  Philadelphia 76ers

In [350]:
nba.sort_index(axis=1).head(10)

    Birthday            Name Position    Salary                   Team
0 1996-09-26    Shake Milton       SG   1445697     Philadelphia 76ers
1 1995-09-27  Christian Wood       PF   1645357        Detroit Pistons
2 1998-08-23   PJ Washington       PF   3831840      Charlotte Hornets
3 1988-10-04    Derrick Rose       PG   7317074        Detroit Pistons
4 1995-07-26   Marial Shayok        G     79568     Philadelphia 76ers
5 1990-03-04  Draymond Green       PF  18539130  Golden State Warriors
6 1995-08-03   Kendrick Nunn       SG   1416852             Miami Heat
7 1995-04-08      Cedi Osman       SF   2907143    Cleveland Cavaliers
8 1988-04-01     Brook Lopez        C  12093024        Milwaukee Bucks
9 1990-12-19    Torrey Craig       SF   2000000         Denver Nuggets

In [352]:
nba.set_index(keys = 'Name')

                               Team Position   Birthday    Salary
Name
Shake Milton     Philadelphia 76ers       SG 1996-09-26   1445697
Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
PJ Washington     Charlotte Hornets       PF 1998-08-23   3831840
Derrick Rose        Detroit Pistons       PG 1988-10-04   7317074
Marial Shayok    Philadelphia 76ers        G 1995-07-26     79568
...                             ...      ...        ...       ...
Austin Rivers       Houston Rockets       PG 1992-08-01   2174310
Harry Giles        Sacramento Kings       PF 1998-04-22   2578800
Robin Lopez         Milwaukee Bucks        C 1988-04-01   4767000
Collin Sexton   Cleveland Cavaliers       PG 1999-01-04   4764960
Ricky Rubio            Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 4 columns]

In [354]:
nba_nameindex = nba.set_index(keys='Name')
nba_nameindex

                               Team Position   Birthday    Salary
Name
Shake Milton     Philadelphia 76ers       SG 1996-09-26   1445697
Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
PJ Washington     Charlotte Hornets       PF 1998-08-23   3831840
Derrick Rose        Detroit Pistons       PG 1988-10-04   7317074
Marial Shayok    Philadelphia 76ers        G 1995-07-26     79568
...                             ...      ...        ...       ...
Austin Rivers       Houston Rockets       PG 1992-08-01   2174310
Harry Giles        Sacramento Kings       PF 1998-04-22   2578800
Robin Lopez         Milwaukee Bucks        C 1988-04-01   4767000
Collin Sexton   Cleveland Cavaliers       PG 1999-01-04   4764960
Ricky Rubio            Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 4 columns]

In [355]:
nba_nameindex_csv = pd.read_csv("../DATA/nba.csv",
                                parse_dates=["Birthday"],
                                index_col="Name")
nba_nameindex_csv

C:\Users\Administrator\AppData\Local\Temp\ipykernel_15312\1477967159.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  nba_nameindex_csv = pd.read_csv("../DATA/nba.csv",

                               Team Position   Birthday    Salary
Name
Shake Milton     Philadelphia 76ers       SG 1996-09-26   1445697
Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
PJ Washington     Charlotte Hornets       PF 1998-08-23   3831840
Derrick Rose        Detroit Pistons       PG 1988-10-04   7317074
Marial Shayok    Philadelphia 76ers        G 1995-07-26     79568
...                             ...      ...        ...       ...
Austin Rivers       Houston Rockets       PG 1992-08-01   2174310
Harry Giles        Sacramento Kings       PF 1998-04-22   2578800
Robin Lopez         Milwaukee Bucks        C 1988-04-01   4767000
Collin Sexton   Cleveland Cavaliers       PG 1999-01-04   4764960
Ricky Rubio            Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 4 columns]

In [356]:
nba.Salary

0       1445697
1       1645357
2       3831840
3       7317074
4         79568
         ...
445     2174310
446     2578800
447     4767000
448     4764960
449    16200000
Name: Salary, Length: 450, dtype: int64

In [357]:
nba["Position"]

0      SG
1      PF
2      PF
3      PG
4       G
       ..
445    PG
446    PF
447     C
448    PG
449    PG
Name: Position, Length: 450, dtype: object

In [358]:
nba[["Salary","Birthday"]].head()

    Salary   Birthday
0  1445697 1996-09-26
1  1645357 1995-09-27
2  3831840 1998-08-23
3  7317074 1988-10-04
4    79568 1995-07-26

In [359]:
nba.select_dtypes(include="object")

               Name                 Team Position
0      Shake Milton   Philadelphia 76ers       SG
1    Christian Wood      Detroit Pistons       PF
2     PJ Washington    Charlotte Hornets       PF
3      Derrick Rose      Detroit Pistons       PG
4     Marial Shayok   Philadelphia 76ers        G
..              ...                  ...      ...
445   Austin Rivers      Houston Rockets       PG
446     Harry Giles     Sacramento Kings       PF
447     Robin Lopez      Milwaukee Bucks        C
448   Collin Sexton  Cleveland Cavaliers       PG
449     Ricky Rubio         Phoenix Suns       PG

[450 rows x 3 columns]

In [360]:
nba.select_dtypes(exclude=['object','int'])

      Birthday
0   1996-09-26
1   1995-09-27
2   1998-08-23
3   1988-10-04
4   1995-07-26
..         ...
445 1992-08-01
446 1998-04-22
447 1988-04-01
448 1999-01-04
449 1990-10-21

[450 rows x 1 columns]

In [362]:
nba_nameindex.loc["LeBron James"]

Team         Los Angeles Lakers
Position                     PF
Birthday    1984-12-30 00:00:00
Salary                 37436858
Name: LeBron James, dtype: object

In [364]:
nba_nameindex.loc[["Kawhi Leonard", "Paul George"]]

                               Team Position   Birthday    Salary
Name
Kawhi Leonard  Los Angeles Clippers       SF 1991-06-29  32742000
Paul George    Los Angeles Clippers       SF 1990-05-02  33005556

In [366]:
nba_nameindex.loc[["Paul George", "Kawhi Leonard"]]

                               Team Position   Birthday    Salary
Name
Paul George    Los Angeles Clippers       SF 1990-05-02  33005556
Kawhi Leonard  Los Angeles Clippers       SF 1991-06-29  32742000

In [367]:
nba_nameindex.sort_index().loc["Otto Porter":"Patrick Beverley"]

                                  Team Position   Birthday    Salary
Name
Otto Porter              Chicago Bulls       SF 1993-06-03  27250576
PJ Dozier               Denver Nuggets       PG 1996-10-25     79568
PJ Washington        Charlotte Hornets       PF 1998-08-23   3831840
Pascal Siakam          Toronto Raptors       PF 1994-04-02   2351838
Pat Connaughton        Milwaukee Bucks       SG 1993-01-06   1723050
Patrick Beverley  Los Angeles Clippers       PG 1988-07-12  12345680

In [368]:
players = ["Otto Porter", "PJ Dozier", "PJ Washington"]
players[0:2]

['Otto Porter', 'PJ Dozier']

In [369]:
nba_nameindex.sort_index().loc["Zach Collins":]

                                   Team Position   Birthday    Salary
Name
Zach Collins     Portland Trail Blazers        C 1997-11-19   4240200
Zach LaVine               Chicago Bulls       PG 1995-03-10  19500000
Zach Norvell         Los Angeles Lakers       SG 1997-12-09     79568
Zhaire Smith         Philadelphia 76ers       SG 1999-06-04   3058800
Zion Williamson    New Orleans Pelicans        F 2000-07-06   9757440
Zylan Cheatham     New Orleans Pelicans       SF 1995-11-17     79568

In [370]:
nba_nameindex.sort_index().loc[:"Al Horford"]

                                    Team Position   Birthday    Salary
Name
Aaron Gordon               Orlando Magic       PF 1995-09-16  19863636
Aaron Holiday             Indiana Pacers       PG 1996-09-30   2239200
Abdel Nader        Oklahoma City Thunder       SF 1993-09-25   1618520
Adam Mokoka                Chicago Bulls        G 1998-07-18     79568
Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000
Al Horford            Philadelphia 76ers        C 1986-06-03  28000000

In [371]:
nba.iloc[300]

Name          Jarred Vanderbilt
Team             Denver Nuggets
Position                     PF
Birthday    1999-04-03 00:00:00
Salary                  1416852
Name: 300, dtype: object

In [372]:
nba.iloc[[100,200,300,400]]

                  Name               Team Position   Birthday   Salary
100        Brian Bowen     Indiana Pacers       SG 1998-10-02    79568
200    Marco Belinelli  San Antonio Spurs       SF 1986-03-25  5846154
300  Jarred Vanderbilt     Denver Nuggets       PF 1999-04-03  1416852
400         Louis King    Detroit Pistons        F 1999-04-06    79568

In [373]:
nba.iloc[400:404]

                     Name                Team Position   Birthday    Salary
400            Louis King     Detroit Pistons        F 1999-04-06     79568
401  Kostas Antetokounmpo  Los Angeles Lakers       PF 1997-11-20     79568
402        Rodions Kurucs       Brooklyn Nets       PF 1998-02-05   1699236
403     Spencer Dinwiddie       Brooklyn Nets       PG 1993-04-06  10605600

In [374]:
nba.iloc[:2]

             Name                Team Position   Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG 1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF 1995-09-27  1645357

In [375]:
nba.iloc[447:]

              Name                 Team Position   Birthday    Salary
447    Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448  Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449    Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

In [376]:
nba.iloc[-10:-6]

                  Name                   Team Position   Birthday   Salary
440       Jared Dudley     Los Angeles Lakers       PF 1985-07-10  2564753
441          Max Strus          Chicago Bulls       SG 1996-03-28    79568
442       Kevon Looney  Golden State Warriors        C 1996-02-06  4464286
443  Willy Hernangomez      Charlotte Hornets        C 1994-05-27  1557250

In [377]:
nba.iloc[0:10:2]

            Name                Team Position   Birthday    Salary
0   Shake Milton  Philadelphia 76ers       SG 1996-09-26   1445697
2  PJ Washington   Charlotte Hornets       PF 1998-08-23   3831840
4  Marial Shayok  Philadelphia 76ers        G 1995-07-26     79568
6  Kendrick Nunn          Miami Heat       SG 1995-08-03   1416852
8    Brook Lopez     Milwaukee Bucks        C 1988-04-01  12093024

In [378]:
nba_nameindex.loc["Giannis Antetokounmpo", "Team"]

'Milwaukee Bucks'

In [379]:
nba_nameindex.loc["James Harden", ["Position", "Birthday"]]

Position                     PG
Birthday    1989-08-26 00:00:00
Name: James Harden, dtype: object

In [380]:
nba_nameindex.loc[
    ["Russell Westbrook", "Anthony Davis"],
    ["Team", "Salary"]
]

                                 Team    Salary
Name
Russell Westbrook     Houston Rockets  38506482
Anthony Davis      Los Angeles Lakers  27093019

In [381]:
nba_nameindex.loc["Joel Embiid", "Position":"Salary"]

Position                      C
Birthday    1994-03-16 00:00:00
Salary                 27504630
Name: Joel Embiid, dtype: object

In [382]:
nba_nameindex.loc["Joel Embiid", "Salary":"Position"]

Series([], Name: Joel Embiid, dtype: object)

In [383]:
nba.iloc[57, 3]

Timestamp('1997-04-17 00:00:00')

In [384]:
nba.iloc[100:104, :3]

              Name                Team Position
100    Brian Bowen      Indiana Pacers       SG
101  Aaron Holiday      Indiana Pacers       PG
102   Troy Daniels  Los Angeles Lakers       SG
103    Buddy Hield    Sacramento Kings       SG

In [385]:
nba_nameindex.at["Austin Rivers", "Birthday"]

Timestamp('1992-08-01 00:00:00')

In [386]:
nba.iat[263,1]

'Orlando Magic'

In [388]:
%%timeit
nba_nameindex.at["Austin Rivers", "Birthday"]

5.24 µs ± 468 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [390]:
%%timeit
nba_nameindex.loc["Austin Rivers", "Birthday"]

7.27 µs ± 168 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [391]:
%%timeit
nba.iat[263, 1]

8.57 µs ± 145 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [392]:
%%timeit
nba.iloc[263, 1]

10.7 µs ± 192 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [394]:
nba_nameindex["Salary"].loc["Damian Lillard"]

29802321

In [395]:
nba_nameindex["Salary"].at["Damian Lillard"]

29802321

In [396]:
nba["Salary"].iloc[234]

2033160

In [397]:
nba["Salary"].iloc[234]

2033160

In [398]:
nba_nameindex.columns

Index(['Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [399]:
nba_nameindex.columns = ["팀", "포지션", '생년월일', '급여']
nba_nameindex.head(3)

                                 팀 포지션       생년월일       급여
Name
Shake Milton    Philadelphia 76ers  SG 1996-09-26  1445697
Christian Wood     Detroit Pistons  PF 1995-09-27  1645357
PJ Washington    Charlotte Hornets  PF 1998-08-23  3831840

In [401]:
nba_nameindex.rename(columns= {
    "생년월일" : "Birthday"
}, inplace=True)
nba_nameindex

                                  팀 포지션   Birthday        급여
Name
Shake Milton     Philadelphia 76ers  SG 1996-09-26   1445697
Christian Wood      Detroit Pistons  PF 1995-09-27   1645357
PJ Washington     Charlotte Hornets  PF 1998-08-23   3831840
Derrick Rose        Detroit Pistons  PG 1988-10-04   7317074
Marial Shayok    Philadelphia 76ers   G 1995-07-26     79568
...                             ...  ..        ...       ...
Austin Rivers       Houston Rockets  PG 1992-08-01   2174310
Harry Giles        Sacramento Kings  PF 1998-04-22   2578800
Robin Lopez         Milwaukee Bucks   C 1988-04-01   4767000
Collin Sexton   Cleveland Cavaliers  PG 1999-01-04   4764960
Ricky Rubio            Phoenix Suns  PG 1990-10-21  16200000

[450 rows x 4 columns]

In [402]:
nba_nameindex.loc["Giannis Antetokounmpo"]

팀               Milwaukee Bucks
포지션                          PF
Birthday    1994-12-06 00:00:00
급여                     25842697
Name: Giannis Antetokounmpo, dtype: object

In [405]:
nba_nameindex.rename(index={
    "Giannis Antetokounmpo": "Greek Freak"
}, inplace=True)
nba_nameindex.loc["Greek Freak"]

팀               Milwaukee Bucks
포지션                          PF
Birthday    1994-12-06 00:00:00
급여                     25842697
Name: Greek Freak, dtype: object

In [408]:
nba_nameindex.set_index("팀").head()

                   포지션   Birthday       급여
팀
Philadelphia 76ers  SG 1996-09-26  1445697
Detroit Pistons     PF 1995-09-27  1645357
Charlotte Hornets   PF 1998-08-23  3831840
Detroit Pistons     PG 1988-10-04  7317074
Philadelphia 76ers   G 1995-07-26    79568

In [409]:
nba_nameindex.reset_index().head()

             Name                   팀 포지션   Birthday       급여
0    Shake Milton  Philadelphia 76ers  SG 1996-09-26  1445697
1  Christian Wood     Detroit Pistons  PF 1995-09-27  1645357
2   PJ Washington   Charlotte Hornets  PF 1998-08-23  3831840
3    Derrick Rose     Detroit Pistons  PG 1988-10-04  7317074
4   Marial Shayok  Philadelphia 76ers   G 1995-07-26    79568

In [410]:
nba_nameindex.reset_index().set_index("팀").head()

                              Name 포지션   Birthday       급여
팀
Philadelphia 76ers    Shake Milton  SG 1996-09-26  1445697
Detroit Pistons     Christian Wood  PF 1995-09-27  1645357
Charlotte Hornets    PJ Washington  PF 1998-08-23  3831840
Detroit Pistons       Derrick Rose  PG 1988-10-04  7317074
Philadelphia 76ers   Marial Shayok   G 1995-07-26    79568

In [412]:
nfl = pd.read_csv(
    "../DATA/nfl.csv",
    parse_dates=["Birthday"],
    index_col="Name",
)
nfl

                                    Team Position   Birthday   Salary
Name
Tremon Smith         Philadelphia Eagles       RB 1996-07-20   570000
Shawn Williams        Cincinnati Bengals       SS 1991-05-13  3500000
Adam Butler         New England Patriots       DT 1994-04-12   645000
Derek Wolfe               Denver Broncos       DE 1990-02-24  8000000
Jake Ryan           Jacksonville Jaguars      OLB 1992-02-27  1000000
...                                  ...      ...        ...      ...
Bashaud Breeland      Kansas City Chiefs       CB 1992-01-30   805000
Craig James          Philadelphia Eagles       CB 1996-04-29   570000
Jonotthan Harrison         New York Jets        C 1991-08-25  1500000
Chuma Edoga                New York Jets       OT 1997-05-25   495000
Tajae Sharpe            Tennessee Titans       WR 1994-12-23  2025000

[1655 rows x 4 columns]

In [416]:
nfl.reset_index(inplace=True)
nfl.set_index("Name",inplace=True)

In [417]:
nfl.value_counts(["Team"])

Team
New York Jets           58
Washington Redskins     56
Kansas City Chiefs      56
San Francisco 49Ers     55
New Orleans Saints      55
Denver Broncos          54
Minnesota Vikings       54
Los Angeles Chargers    54
Dallas Cowboys          53
Chicago Bears           53
Detroit Lions           53
Seattle Seahawks        53
Buffalo Bills           53
Atlanta Falcons         53
Houston Texans          52
Philadelphia Eagles     52
Los Angeles Rams        52
New York Giants         52
Oakland Raiders         51
Arizona Cardinals       51
Cincinnati Bengals      51
Green Bay Packers       51
Jacksonville Jaguars    50
Cleveland Browns        49
Carolina Panthers       49
Miami Dolphins          49
Indianapolis Colts      49
New England Patriots    49
Baltimore Ravens        48
Pittsburgh Steelers     47
Tampa Bay Buccaneers    47
Tennessee Titans        46
Name: count, dtype: int64

In [419]:
nfl.sort_values(by = "Salary", ascending=False).head(5)

                                 Team Position   Birthday    Salary
Name
Kirk Cousins        Minnesota Vikings       QB 1988-08-19  27500000
Jameis Winston   Tampa Bay Buccaneers       QB 1994-01-06  20922000
Marcus Mariota       Tennessee Titans       QB 1993-10-30  20922000
Derek Carr            Oakland Raiders       QB 1991-03-28  19900000
Jimmy Garoppolo   San Francisco 49Ers       QB 1991-11-02  17200000

In [420]:
nfl.sort_values(by = ["Team", "Salary"], ascending=[True, False])

                                   Team Position   Birthday    Salary
Name
Chandler Jones        Arizona Cardinals      OLB 1990-02-27  16500000
Patrick Peterson      Arizona Cardinals       CB 1990-07-11  11000000
Larry Fitzgerald      Arizona Cardinals       WR 1983-08-31  11000000
David Johnson         Arizona Cardinals       RB 1991-12-16   5700000
Justin Pugh           Arizona Cardinals        G 1990-08-15   5000000
...                                 ...      ...        ...       ...
Ross Pierschbacher  Washington Redskins        C 1995-05-05    495000
Kelvin Harmon       Washington Redskins       WR 1996-12-15    495000
Wes Martin          Washington Redskins        G 1996-05-09    495000
Jimmy Moreland      Washington Redskins       CB 1995-08-26    495000
Jeremy Reaves       Washington Redskins       SS 1996-08-29    495000

[1655 rows x 4 columns]

In [422]:
nfl.sort_values(by = "Birthday" , ascending=True).head(1).index[0]

'Tom Brady'

In [425]:
nfl.sort_values(by = "Birthday" , ascending=True).head(1).Birthday.iloc[0]

Timestamp('1977-08-03 00:00:00')